# num = int(input())
# chr_ = chr(num)
# if chr_.isalpha():
#     print(f"'это буква {chr_}'")
# else: 
#     print('это не буква')

#for num in range(11):
   #print(num)
# num = int(input('введите число'))
# chr_ = chr(num)
# if chr_.isalpha():
#     print(f'это буква'{chr_})
# else: 
#     print(f'Это не буква, а символ'{chr_''})
# num = int(input())
# chr_ = chr(num)
# if chr_.isalpha():
#     print(f"это буква '{chr_}'")
# else: 
#     print(f"Это не буква, а символ '{chr_}'")


# number = int(input('Enter number'))
# max_number = 0
# while number % 10 > max_number:
#     max_number = number % 10 
#     number = number // 10
# print(max_number)
#my_list = [1, 2, 3, 4, 5]
#for item in my_list:
    #print(item)
# for i in range(1, 6):
#     if i == 4:
#         print(i)
#         break
#     print(i)


# num = 100
# while num < 0:
#     print('hello world')




# condition = True
# while condition:
#     print(9)
#     # блок кода, выполняемый, пока condition истинно
#     if some_condition:
#         condition = False

# num = int(input())
# chr_ = chr(num)
# if chr_.isalpha():
#     print(f'это буква "{chr_}"')
# else: 
#     print(f'Это не буква, а символ "{chr_}"')


# greet = (input())
# if greet == 'Hi' in greet == 'Hi':
#     print('привет!')
# else:
#     print('No')
# greeting = (input())
# if 'Hi' in greeting == 'Hi':
#     print('Привет!')
# else:
#     print('No')

# count = 0 
# number = input('chislo: ')
# if number.isdigit() and int(number) >= count:
#     count = int(number)
#     count = 0 
# number = input('chislo: ')
# if number.isdigit and int(number) >= count:
#     count = int(number)
    
#     print(count)



# lang = 'en'
# if lang == 'kg':
#     print('Бул кыргыз тили')
# elif lang == 'en':
#     print('This is english')
# elif lang == 'ru':
#     print('Это русский')
# elif lang == 'de':
#     print('Das ist Deutsch')
# else:


# streeng = '666666'
# if streeng [:3] == streeng [3:]: 
#     print('да')
# else: 
#     print('нет')
# Напишите программу, которая запрашивает у пользователя имя и возраст, а затем выводит сообщение вида "Привет, [имя]! Тебе [возраст] лет."
# imya = input('enter your name: ')
# age = input('enter your age: ')
# print('привет!'  + ' ' + imya )
# print('тебе' + ' ' +  age  + ' ' +  'лет.')
#Напишите программу, которая находит сумму всех чисел от 1 до 10 и выводит результат.
# i = 0 
# for i in range(1,11):

#     print(i)

# a = input('')
# b = input('')
# c = input('')
# result = a + b + c 
# result =' '.join(sorted(result))
# # result2 =
# print(result)

# age = int(input('ваш возраст?'))
# if age >= 18:
#     print('Добро пожаловать')
# else:
#     print('доступ запрешен')


# month = int(input())
# if month <= 2 or month == 12:
#     print('зима')
# elif 3 <= month <= 5:
#     print('весна')
# elif 6 <=  month <= 9:
#     print('лето')
# elif 9 <= month <= 11: 
#     print('осен')
# else:
#     print('внедиапазоне')

# Запросите у пользователя строку
# Если строка состоит только из чисел, то выведите "is digit"
# Если строка состоит только из букв, то выведите "is alpha"
# В остальных случаях выведите "is ASCII"

# string = input('введите строку: ')
# if string.isdigit():
#     print('is diget')
# elif string.isalpha():
#     print('is alpha')
# else:

#     print('is ASCII')
# У треугольника сумма любых двух сторон должна быть больше третьей. Иначе две стороны просто "лягут" на третью и треугольник не получится.
# Запросите у пользователя длины трех сторон. Программа должна определять, может ли существовать треугольник при таких длинах. Если да, то напечатать 'yes', нет - 'no
# import cmath

# Вы принимаете от пользователя последовательность чисел, разделенных запятой в переменную.
# Создайте список list_ и кортеж tuple_ с этими числами и распечатайте их.
# Для проверки, введите числа через запятую(без пробелов) в поле во вкладке INPUT.
# Например, для чисел введенных как 1,2,3,4 вывод будет:

num1 = list(input(' '))
num2 = dict(input(''))
print(num1)
print(num2)